CSI API ETABS v1
cFrameObj.GetAllFrames Method
 Retrieves select data for all frame objects in the model
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetAllFrames(
	ref int NumberNames,
	ref string[] MyName,
	ref string[] PropName,
	ref string[] StoryName,
	ref string[] PointName1,
	ref string[] PointName2,
	ref double[] Point1X,
	ref double[] Point1Y,
	ref double[] Point1Z,
	ref double[] Point2X,
	ref double[] Point2Y,
	ref double[] Point2Z,
	ref double[] Angle,
	ref double[] Offset1X,
	ref double[] Offset2X,
	ref double[] Offset1Y,
	ref double[] Offset2Y,
	ref double[] Offset1Z,
	ref double[] Offset2Z,
	ref int[] CardinalPoint,
	string csys = "Global"
)
Function GetAllFrames (
	ByRef NumberNames As Integer,
	ByRef MyName As String(),
	ByRef PropName As String(),
	ByRef StoryName As String(),
	ByRef PointName1 As String(),
	ByRef PointName2 As String(),
	ByRef Point1X As Double(),
	ByRef Point1Y As Double(),
	ByRef Point1Z As Double(),
	ByRef Point2X As Double(),
	ByRef Point2Y As Double(),
	ByRef Point2Z As Double(),
	ByRef Angle As Double(),
	ByRef Offset1X As Double(),
	ByRef Offset2X As Double(),
	ByRef Offset1Y As Double(),
	ByRef Offset2Y As Double(),
	ByRef Offset1Z As Double(),
	ByRef Offset2Z As Double(),
	ByRef CardinalPoint As Integer(),
	Optional csys As String = "Global"
) As Integer
Dim instance As cFrameObj
Dim NumberNames As Integer
Dim MyName As String()
Dim PropName As String()
Dim StoryName As String()
Dim PointName1 As String()
Dim PointName2 As String()
Dim Point1X As Double()
Dim Point1Y As Double()
Dim Point1Z As Double()
Dim Point2X As Double()
Dim Point2Y As Double()
Dim Point2Z As Double()
Dim Angle As Double()
Dim Offset1X As Double()
Dim Offset2X As Double()
Dim Offset1Y As Double()
Dim Offset2Y As Double()
Dim Offset1Z As Double()
Dim Offset2Z As Double()
Dim CardinalPoint As Integer()
Dim csys As String
Dim returnValue As Integer
returnValue = instance.GetAllFrames(NumberNames,
	MyName, PropName, StoryName, PointName1,
	PointName2, Point1X, Point1Y, Point1Z,
	Point2X, Point2Y, Point2Z, Angle,
	Offset1X, Offset2X, Offset1Y, Offset2Y,
	Offset1Z, Offset2Z, CardinalPoint,
	csys)
int GetAllFrames(
	int% NumberNames,
	array<String^>^% MyName,
	array<String^>^% PropName,
	array<String^>^% StoryName,
	array<String^>^% PointName1,
	array<String^>^% PointName2,
	array<double>^% Point1X,
	array<double>^% Point1Y,
	array<double>^% Point1Z,
	array<double>^% Point2X,
	array<double>^% Point2Y,
	array<double>^% Point2Z,
	array<double>^% Angle,
	array<double>^% Offset1X,
	array<double>^% Offset2X,
	array<double>^% Offset1Y,
	array<double>^% Offset2Y,
	array<double>^% Offset1Z,
	array<double>^% Offset2Z,
	array<int>^% CardinalPoint,
	String^ csys = L"Global"
)
abstract GetAllFrames :
        NumberNames : int byref *
        MyName : string[] byref *
        PropName : string[] byref *
        StoryName : string[] byref *
        PointName1 : string[] byref *
        PointName2 : string[] byref *
        Point1X : float[] byref *
        Point1Y : float[] byref *
        Point1Z : float[] byref *
        Point2X : float[] byref *
        Point2Y : float[] byref *
        Point2Z : float[] byref *
        Angle : float[] byref *
        Offset1X : float[] byref *
        Offset2X : float[] byref *
        Offset1Y : float[] byref *
        Offset2Y : float[] byref *
        Offset1Z : float[] byref *
        Offset2Z : float[] byref *
        CardinalPoint : int[] byref *
        ?csys : string
(* Defaults:
        let _csys = defaultArg csys "Global"
*)
-> int
Parameters
NumberNames
Type: System.Int32
MyName
Type: System.String[]
PropName
Type: System.String[]
StoryName
Type: System.String[]
PointName1
Type: System.String[]
PointName2
Type: System.String[]
Point1X
Type: System.Double[]
Point1Y
Type: System.Double[]
Point1Z
Type: System.Double[]
Point2X
Type: System.Double[]
Point2Y
Type: System.Double[]
Point2Z
Type: System.Double[]
Angle
Type: System.Double[]
Offset1X
Type: System.Double[]
Offset2X
Type: System.Double[]
Offset1Y
Type: System.Double[]
Offset2Y
Type: System.Double[]
Offset1Z
Type: System.Double[]
Offset2Z
Type: System.Double[]
CardinalPoint
Type: System.Int32[]
csys (Optional)
Type: System.String
Return Value
Type: Int32
Remarks
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace